breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f410x8.h
/********************************************************************************************************************/
/********************************* OPA ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for OPA_CSR register *******************************************/
#define OPA_CSR_OPAEN_Pos                      (0U)
#define OPA_CSR_OPAEN_Msk                      (0x1UL<<OPA_CSR_OPAEN_Pos)                     /*!< 0x00000001 */
#define OPA_CSR_OPAEN                          OPA_CSR_OPAEN_Msk                              /*!< OPA Enable */
#define OPA_CSR_OPA_CMP_CR_Pos                 (1U)
#define OPA_CSR_OPA_CMP_CR_Msk                 (0x1UL<<OPA_CSR_OPA_CMP_CR_Pos)                /*!< 0x00000002 */
#define OPA_CSR_OPA_CMP_CR                     OPA_CSR_OPA_CMP_CR_Msk                         /*!< OPA2 or COMP selection */
#define OPA_CSR_OPAINTOEN_Pos                  (8U)
#define OPA_CSR_OPAINTOEN_Msk                  (0x1UL<<OPA_CSR_OPAINTOEN_Pos)                 /*!< 0x00000100 */
#define OPA_CSR_OPAINTOEN                      OPA_CSR_OPAINTOEN_Msk                          /*!< OPA internal output enable */
#define OPA_CSR_OPA_CMP_OUT_Pos                (30U)
#define OPA_CSR_OPA_CMP_OUT_Msk                (0x1UL<<OPA_CSR_OPA_CMP_OUT_Pos)               /*!< 0x40000000 */
#define OPA_CSR_OPA_CMP_OUT                    OPA_CSR_OPA_CMP_OUT_Msk                        /*!< OPA2 change COMP output level */
#define OPA_CSR_LOCK_Pos                       (31U)
#define OPA_CSR_LOCK_Msk                       (0x1UL<<OPA_CSR_LOCK_Pos)                      /*!< 0x80000000 */
#define OPA_CSR_LOCK                           OPA_CSR_LOCK_Msk                               /*!< OPA_CSR register Lock */

/*********************************** Bit definition for OPA_FR register ******************************************/
#define OPA_FR_FLTEN_Pos                       (0U)
#define OPA_FR_FLTEN_Msk                       (0x1UL<<OPA_FR_FLTEN_Pos)                      /*!< 0x00000001 */
#define OPA_FR_FLTEN                           OPA_FR_FLTEN_Msk                               /*!< OPA2 Digital Filter Enable */
#define OPA_FR_FLTCNT_Pos                      (16U)
#define OPA_FR_FLTCNT_Msk                      (0xFFFFUL<<OPA_FR_FLTCNT_Pos)                  /*!< 0xFFFF0000 */
#define OPA_FR_FLTCNT                          OPA_FR_FLTCNT_Msk                              /*!< OPA2 Sample Filter Counter */

/********************************** Bit definition for OPA_FINT register *****************************************/
#define OPA_INTR_INTEN_Pos                     (0U)
#define OPA_INTR_INTEN_Msk                     (0x1UL<<OPA_INTR_INTEN_Pos)                    /*!< 0x00000001 */
#define OPA_INTR_INTEN                         OPA_INTR_INTEN_Msk                             /*!< OPA2 Interrupt Enable */
#define OPA_INTR_INTIF_Pos                     (1U)
#define OPA_INTR_INTIF_Msk                     (0x1UL<<OPA_INTR_INTIF_Pos)                    /*!< 0x00000002 */
#define OPA_INTR_INTIF                         OPA_INTR_INTIF_Msk                             /*!< OPA2 Interrupt Flag */
#define OPA_INTR_CINTIF_Pos                    (2U)
#define OPA_INTR_CINTIF_Msk                    (0x1UL<<OPA_INTR_CINTIF_Pos)                   /*!< 0x00000004 */
#define OPA_INTR_CINTIF                        OPA_INTR_CINTIF_Msk                            /*!< OPA2 Interrupt Flag Clear */

/********************************************************************************************************************/
/********************************* I2C ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for I2C_CR1 register **********************************************/
#define I2C_CR1_PE_Pos                            (0U)
#define I2C_CR1_PE_Msk                            (0x1UL<<I2C_CR1_PE_Pos)                           /*!< 0x00000001 */
#define I2C_CR1_PE                                I2C_CR1_PE_Msk                                    /*!< Peripheral enable */
#define I2C_CR1_SMBUS_Pos                         (1U)
#define I2C_CR1_SMBUS_Msk                         (0x1UL<<I2C_CR1_SMBUS_Pos)                        /*!< 0x00000002 */
#define I2C_CR1_SMBUS                             I2C_CR1_SMBUS_Msk                                 /*!< SMBus mode */
#define I2C_CR1_WUPEN_Pos                         (2U)
#define I2C_CR1_WUPEN_Msk                         (0x1UL<<I2C_CR1_WUPEN_Pos)                        /*!< 0x00000004 */
#define I2C_CR1_WUPEN                             I2C_CR1_WUPEN_Msk                                 /*!< Wakeup from Stop mode enable */
#define I2C_CR1_SMBTYPE_Pos                       (3U)
#define I2C_CR1_SMBTYPE_Msk                       (0x1UL<<I2C_CR1_SMBTYPE_Pos)                      /*!< 0x00000008 */
#define I2C_CR1_SMBTYPE                           I2C_CR1_SMBTYPE_Msk                               /*!< SMBus type */
#define I2C_CR1_ENARP_Pos                         (4U)
#define I2C_CR1_ENARP_Msk                         (0x1UL<<I2C_CR1_ENARP_Pos)                        /*!< 0x00000010 */
#define I2C_CR1_ENARP                             I2C_CR1_ENARP_Msk                                 /*!< ARP enable */
#define I2C_CR1_ENPEC_Pos                         (5U)
#define I2C_CR1_ENPEC_Msk                         (0x1UL<<I2C_CR1_ENPEC_Pos)                        /*!< 0x00000020 */
#define I2C_CR1_ENPEC                             I2C_CR1_ENPEC_Msk                                 /*!< PEC enable */
#define I2C_CR1_ENGC_Pos                          (6U)
#define I2C_CR1_ENGC_Msk                          (0x1UL<<I2C_CR1_ENGC_Pos)                         /*!< 0x00000040 */
#define I2C_CR1_ENGC                              I2C_CR1_ENGC_Msk                                  /*!< General call enable */
#define I2C_CR1_NOSTRETCH_Pos                     (7U)
#define I2C_CR1_NOSTRETCH_Msk                     (0x1UL<<I2C_CR1_NOSTRETCH_Pos)                    /*!< 0x00000080 */
#define I2C_CR1_NOSTRETCH                         I2C_CR1_NOSTRETCH_Msk                             /*!< Clock stretching disable (Slave mode) */
#define I2C_CR1_START_Pos                         (8U)
#define I2C_CR1_START_Msk                         (0x1UL<<I2C_CR1_START_Pos)                        /*!< 0x00000100 */
#define I2C_CR1_START                             I2C_CR1_START_Msk                                 /*!< Start generation */
#define I2C_CR1_STOP_Pos                          (9U)
#define I2C_CR1_STOP_Msk                          (0x1UL<<I2C_CR1_STOP_Pos)                         /*!< 0x00000200 */
#define I2C_CR1_STOP                              I2C_CR1_STOP_Msk                                  /*!< Stop generation */
#define I2C_CR1_ACK_Pos                           (10U)
#define I2C_CR1_ACK_Msk                           (0x1UL<<I2C_CR1_ACK_Pos)                          /*!< 0x00000400 */
#define I2C_CR1_ACK                               I2C_CR1_ACK_Msk                                   /*!< Acknowledge enable */
#define I2C_CR1_POS_Pos                           (11U)
#define I2C_CR1_POS_Msk                           (0x1UL<<I2C_CR1_POS_Pos)                          /*!< 0x00000800 */
#define I2C_CR1_POS                               I2C_CR1_POS_Msk                                   /*!< Acknowledge(for data reception) */
#define I2C_CR1_PEC_Pos                           (12U)
#define I2C_CR1_PEC_Msk                           (0x1UL<<I2C_CR1_PEC_Pos)                          /*!< 0x00001000 */
#define I2C_CR1_PEC                               I2C_CR1_PEC_Msk                                   /*!< Packet error checking */
#define I2C_CR1_ALERT_Pos                         (13U)
#define I2C_CR1_ALERT_Msk                         (0x1UL<<I2C_CR1_ALERT_Pos)                        /*!< 0x00002000 */
#define I2C_CR1_ALERT                             I2C_CR1_ALERT_Msk                                 /*!< SMBus alert */
#define I2C_CR1_SWRST_Pos                         (15U)
#define I2C_CR1_SWRST_Msk                         (0x1UL<<I2C_CR1_SWRST_Pos)                        /*!< 0x00008000 */
#define I2C_CR1_SWRST                             I2C_CR1_SWRST_Msk                                 /*!< Software reset */
#define I2C_CR1_WKUP_DIV_Pos                      (16U)
#define I2C_CR1_WKUP_DIV_Msk                      (0x3UL<<I2C_CR1_WKUP_DIV_Pos)                     /*!< 0x00030000 */
#define I2C_CR1_WKUP_DIV                          I2C_CR1_WKUP_DIV_Msk                              /*!< PCLK division */
#define I2C_CR1_WKUP_DIV_0                        (0x1UL<<I2C_CR1_WKUP_DIV_Pos)                     /*!< 0x00010000 */
#define I2C_CR1_WKUP_DIV_1                        (0x2UL<<I2C_CR1_WKUP_DIV_Pos)                     /*!< 0x00020000 */
#define I2C_CR1_WKUP_CNT_Pos                      (18U)
#define I2C_CR1_WKUP_CNT_Msk                      (0x3UL<<I2C_CR1_WKUP_CNT_Pos)                     /*!< 0x000C0000 */
#define I2C_CR1_WKUP_CNT                          I2C_CR1_WKUP_CNT_Msk                              /*!< Timeout count number */
#define I2C_CR1_WKUP_CNT_0                        (0x1UL<<I2C_CR1_WKUP_CNT_Pos)                     /*!< 0x00040000 */
#define I2C_CR1_WKUP_CNT_1                        (0x2UL<<I2C_CR1_WKUP_CNT_Pos)                     /*!< 0x00080000 */

