breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f410x8.h
/********************************* Bit definition for RCC_APB1ENR2 register *****************************************/
#define RCC_APB1ENR2_LPTIM1EN_Pos                 (0U)
#define RCC_APB1ENR2_LPTIM1EN_Msk                 (0x1UL<<RCC_APB1ENR2_LPTIM1EN_Pos)                /*!< 0x00000001 */
#define RCC_APB1ENR2_LPTIM1EN                     RCC_APB1ENR2_LPTIM1EN_Msk                         
#define RCC_APB1ENR2_LPUART1EN_Pos                (1U)
#define RCC_APB1ENR2_LPUART1EN_Msk                (0x1UL<<RCC_APB1ENR2_LPUART1EN_Pos)               /*!< 0x00000002 */
#define RCC_APB1ENR2_LPUART1EN                    RCC_APB1ENR2_LPUART1EN_Msk                        

/********************************* Bit definition for RCC_APB2ENR register ******************************************/
#define RCC_APB2ENR_SYSCFGEN_Pos                  (0U)
#define RCC_APB2ENR_SYSCFGEN_Msk                  (0x1UL<<RCC_APB2ENR_SYSCFGEN_Pos)                 /*!< 0x00000001 */
#define RCC_APB2ENR_SYSCFGEN                      RCC_APB2ENR_SYSCFGEN_Msk                          
#define RCC_APB2ENR_ADC1EN_Pos                    (9U)
#define RCC_APB2ENR_ADC1EN_Msk                    (0x1UL<<RCC_APB2ENR_ADC1EN_Pos)                   /*!< 0x00000200 */
#define RCC_APB2ENR_ADC1EN                        RCC_APB2ENR_ADC1EN_Msk                            
#define RCC_APB2ENR_TIM1EN_Pos                    (11U)
#define RCC_APB2ENR_TIM1EN_Msk                    (0x1UL<<RCC_APB2ENR_TIM1EN_Pos)                   /*!< 0x00000800 */
#define RCC_APB2ENR_TIM1EN                        RCC_APB2ENR_TIM1EN_Msk                            
#define RCC_APB2ENR_SPI1EN_Pos                    (12U)
#define RCC_APB2ENR_SPI1EN_Msk                    (0x1UL<<RCC_APB2ENR_SPI1EN_Pos)                   /*!< 0x00001000 */
#define RCC_APB2ENR_SPI1EN                        RCC_APB2ENR_SPI1EN_Msk                            
#define RCC_APB2ENR_USART1EN_Pos                  (14U)
#define RCC_APB2ENR_USART1EN_Msk                  (0x1UL<<RCC_APB2ENR_USART1EN_Pos)                 /*!< 0x00004000 */
#define RCC_APB2ENR_USART1EN                      RCC_APB2ENR_USART1EN_Msk                          
#define RCC_APB2ENR_PWM3EN_Pos                    (16U)
#define RCC_APB2ENR_PWM3EN_Msk                    (0x1UL<<RCC_APB2ENR_PWM3EN_Pos)                   /*!< 0x00010000 */
#define RCC_APB2ENR_PWM3EN                        RCC_APB2ENR_PWM3EN_Msk                            
#define RCC_APB2ENR_PWM4EN_Pos                    (17U)
#define RCC_APB2ENR_PWM4EN_Msk                    (0x1UL<<RCC_APB2ENR_PWM4EN_Pos)                   /*!< 0x00020000 */
#define RCC_APB2ENR_PWM4EN                        RCC_APB2ENR_PWM4EN_Msk                            
#define RCC_APB2ENR_TIM15EN_Pos                   (22U)
#define RCC_APB2ENR_TIM15EN_Msk                   (0x1UL<<RCC_APB2ENR_TIM15EN_Pos)                  /*!< 0x00400000 */
#define RCC_APB2ENR_TIM15EN                       RCC_APB2ENR_TIM15EN_Msk                           
#define RCC_APB2ENR_TIM16EN_Pos                   (23U)
#define RCC_APB2ENR_TIM16EN_Msk                   (0x1UL<<RCC_APB2ENR_TIM16EN_Pos)                  /*!< 0x00800000 */
#define RCC_APB2ENR_TIM16EN                       RCC_APB2ENR_TIM16EN_Msk                           
#define RCC_APB2ENR_TIM17EN_Pos                   (24U)
#define RCC_APB2ENR_TIM17EN_Msk                   (0x1UL<<RCC_APB2ENR_TIM17EN_Pos)                  /*!< 0x01000000 */
#define RCC_APB2ENR_TIM17EN                       RCC_APB2ENR_TIM17EN_Msk                           
#define RCC_APB2ENR_COMPEN_Pos                    (27U)
#define RCC_APB2ENR_COMPEN_Msk                    (0x1UL<<RCC_APB2ENR_COMPEN_Pos)                   /*!< 0x08000000 */
#define RCC_APB2ENR_COMPEN                        RCC_APB2ENR_COMPEN_Msk                            
#define RCC_APB2ENR_OPAEN_Pos                     (28U)
#define RCC_APB2ENR_OPAEN_Msk                     (0x1UL<<RCC_APB2ENR_OPAEN_Pos)                    /*!< 0x10000000 */
#define RCC_APB2ENR_OPAEN                         RCC_APB2ENR_OPAEN_Msk                           

/********************************* Bit definition for RCC_CCIPR register ********************************************/
#define RCC_CCIPR_USART1SEL_Pos                   (0U)
#define RCC_CCIPR_USART1SEL_Msk                   (0x3UL<<RCC_CCIPR_USART1SEL_Pos)                  /*!< 0x00000003 */
#define RCC_CCIPR_USART1SEL                       RCC_CCIPR_USART1SEL_Msk
#define RCC_CCIPR_USART1SEL_0                     (0x1UL<<RCC_CCIPR_USART1SEL_Pos)                  /*!< 0x00000001 */
#define RCC_CCIPR_USART1SEL_1                     (0x2UL<<RCC_CCIPR_USART1SEL_Pos)                  /*!< 0x00000002 */
#define RCC_CCIPR_LPUART1SEL_Pos                  (12U)
#define RCC_CCIPR_LPUART1SEL_Msk                  (0x3UL<<RCC_CCIPR_LPUART1SEL_Pos)                 /*!< 0x00003000 */
#define RCC_CCIPR_LPUART1SEL                      RCC_CCIPR_LPUART1SEL_Msk
#define RCC_CCIPR_LPUART1SEL_0                    (0x1UL<<RCC_CCIPR_LPUART1SEL_Pos)                 /*!< 0x00001000 */
#define RCC_CCIPR_LPUART1SEL_1                    (0x2UL<<RCC_CCIPR_LPUART1SEL_Pos)                 /*!< 0x00002000 */
#define RCC_CCIPR_LPTIM1SEL_Pos                   (14U)
#define RCC_CCIPR_LPTIM1SEL_Msk                   (0x3UL<<RCC_CCIPR_LPTIM1SEL_Pos)                  /*!< 0x0000C000 */
#define RCC_CCIPR_LPTIM1SEL                       RCC_CCIPR_LPTIM1SEL_Msk
#define RCC_CCIPR_LPTIM1SEL_0                     (0x1UL<<RCC_CCIPR_LPTIM1SEL_Pos)                  /*!< 0x00004000 */
#define RCC_CCIPR_LPTIM1SEL_1                     (0x2UL<<RCC_CCIPR_LPTIM1SEL_Pos)                  /*!< 0x00008000 */
#define RCC_CCIPR_COMP1SEL_Pos                    (16U)
#define RCC_CCIPR_COMP1SEL_Msk                    (0x3UL<<RCC_CCIPR_COMP1SEL_Pos)                   /*!< 0x00030000 */
#define RCC_CCIPR_COMP1SEL                        RCC_CCIPR_COMP1SEL_Msk
#define RCC_CCIPR_COMP1SEL_0                      (0x1UL<<RCC_CCIPR_COMP1SEL_Pos)                   /*!< 0x00010000 */
#define RCC_CCIPR_COMP1SEL_1                      (0x2UL<<RCC_CCIPR_COMP1SEL_Pos)                   /*!< 0x00020000 */
#define RCC_CCIPR_COMP2SEL_Pos                    (18U)
#define RCC_CCIPR_COMP2SEL_Msk                    (0x3UL<<RCC_CCIPR_COMP2SEL_Pos)                   /*!< 0x000C0000 */
#define RCC_CCIPR_COMP2SEL                        RCC_CCIPR_COMP2SEL_Msk
#define RCC_CCIPR_COMP2SEL_0                      (0x1UL<<RCC_CCIPR_COMP2SEL_Pos)                   /*!< 0x00040000 */
#define RCC_CCIPR_COMP2SEL_1                      (0x2UL<<RCC_CCIPR_COMP2SEL_Pos)                   /*!< 0x00080000 */
#define RCC_CCIPR_ADC1SEL_Pos                     (24U)
#define RCC_CCIPR_ADC1SEL_Msk                     (0x3UL<<RCC_CCIPR_ADC1SEL_Pos)                    /*!< 0x03000000 */
#define RCC_CCIPR_ADC1SEL                         RCC_CCIPR_ADC1SEL_Msk
#define RCC_CCIPR_ADC1SEL_0                       (0x1UL<<RCC_CCIPR_ADC1SEL_Pos)                    /*!< 0x01000000 */
#define RCC_CCIPR_ADC1SEL_1                       (0x2UL<<RCC_CCIPR_ADC1SEL_Pos)                    /*!< 0x02000000 */
#define RCC_CCIPR_OPA2SEL_Pos                     (30U)
#define RCC_CCIPR_OPA2SEL_Msk                     (0x3UL<<RCC_CCIPR_OPA2SEL_Pos)                    /*!< 0xC0000000 */
#define RCC_CCIPR_OPA2SEL                         RCC_CCIPR_OPA2SEL_Msk
#define RCC_CCIPR_OPA2SEL_0                       (0x1UL<<RCC_CCIPR_OPA2SEL_Pos)                    /*!< 0x40000000 */
#define RCC_CCIPR_OPA2SEL_1                       (0x2UL<<RCC_CCIPR_OPA2SEL_Pos)                    /*!< 0x80000000 */

