breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f410x8.h
/********************************* Bit definition for SYSCFG_EXTICR1 register ***************************************/
#define SYSCFG_EXTICR1_EXTI0_Pos                  (0U)
#define SYSCFG_EXTICR1_EXTI0_Msk                  (0x3UL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x00000003 */
#define SYSCFG_EXTICR1_EXTI0                      SYSCFG_EXTICR1_EXTI0_Msk
#define SYSCFG_EXTICR1_EXTI0_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x00000001 */
#define SYSCFG_EXTICR1_EXTI0_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x00000002 */
#define SYSCFG_EXTICR1_EXTI1_Pos                  (4U)
#define SYSCFG_EXTICR1_EXTI1_Msk                  (0x3UL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x00000030 */
#define SYSCFG_EXTICR1_EXTI1                      SYSCFG_EXTICR1_EXTI1_Msk
#define SYSCFG_EXTICR1_EXTI1_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x00000010 */
#define SYSCFG_EXTICR1_EXTI1_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x00000020 */
#define SYSCFG_EXTICR1_EXTI2_Pos                  (8U)
#define SYSCFG_EXTICR1_EXTI2_Msk                  (0x3UL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000300 */
#define SYSCFG_EXTICR1_EXTI2                      SYSCFG_EXTICR1_EXTI2_Msk
#define SYSCFG_EXTICR1_EXTI2_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000100 */
#define SYSCFG_EXTICR1_EXTI2_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000200 */
#define SYSCFG_EXTICR1_EXTI3_Pos                  (12U)
#define SYSCFG_EXTICR1_EXTI3_Msk                  (0x3UL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x00003000 */
#define SYSCFG_EXTICR1_EXTI3                      SYSCFG_EXTICR1_EXTI3_Msk                          /*!< EXTI 0~3 configuration */
#define SYSCFG_EXTICR1_EXTI3_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x00001000 */
#define SYSCFG_EXTICR1_EXTI3_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x00002000 */

/********************************* Bit definition for SYSCFG_EXTICR2 register ***************************************/
#define SYSCFG_EXTICR2_EXTI4_Pos                  (0U)
#define SYSCFG_EXTICR2_EXTI4_Msk                  (0x3UL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x00000003 */
#define SYSCFG_EXTICR2_EXTI4                      SYSCFG_EXTICR2_EXTI4_Msk
#define SYSCFG_EXTICR2_EXTI4_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x00000001 */
#define SYSCFG_EXTICR2_EXTI4_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x00000002 */
#define SYSCFG_EXTICR2_EXTI5_Pos                  (4U)
#define SYSCFG_EXTICR2_EXTI5_Msk                  (0x3UL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x00000030 */
#define SYSCFG_EXTICR2_EXTI5                      SYSCFG_EXTICR2_EXTI5_Msk
#define SYSCFG_EXTICR2_EXTI5_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x00000010 */
#define SYSCFG_EXTICR2_EXTI5_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x00000020 */
#define SYSCFG_EXTICR2_EXTI6_Pos                  (8U)
#define SYSCFG_EXTICR2_EXTI6_Msk                  (0x3UL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000300 */
#define SYSCFG_EXTICR2_EXTI6                      SYSCFG_EXTICR2_EXTI6_Msk
#define SYSCFG_EXTICR2_EXTI6_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000100 */
#define SYSCFG_EXTICR2_EXTI6_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000200 */
#define SYSCFG_EXTICR2_EXTI7_Pos                  (12U)
#define SYSCFG_EXTICR2_EXTI7_Msk                  (0x3UL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x00003000 */
#define SYSCFG_EXTICR2_EXTI7                      SYSCFG_EXTICR2_EXTI7_Msk                          /*!< EXTI 4~7 configuration */
#define SYSCFG_EXTICR2_EXTI7_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x00001000 */
#define SYSCFG_EXTICR2_EXTI7_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x00002000 */

/********************************* Bit definition for SYSCFG_EXTICR3 register ***************************************/
#define SYSCFG_EXTICR3_EXTI8_Pos                  (0U)
#define SYSCFG_EXTICR3_EXTI8_Msk                  (0x3UL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x00000003 */
#define SYSCFG_EXTICR3_EXTI8                      SYSCFG_EXTICR3_EXTI8_Msk
#define SYSCFG_EXTICR3_EXTI8_0                    (0x1UL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x00000001 */
#define SYSCFG_EXTICR3_EXTI8_1                    (0x2UL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x00000002 */
#define SYSCFG_EXTICR3_EXTI9_Pos                  (4U)
#define SYSCFG_EXTICR3_EXTI9_Msk                  (0x3UL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x00000030 */
#define SYSCFG_EXTICR3_EXTI9                      SYSCFG_EXTICR3_EXTI9_Msk
#define SYSCFG_EXTICR3_EXTI9_0                    (0x1UL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x00000010 */
#define SYSCFG_EXTICR3_EXTI9_1                    (0x2UL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x00000020 */
#define SYSCFG_EXTICR3_EXTI10_Pos                 (8U)
#define SYSCFG_EXTICR3_EXTI10_Msk                 (0x3UL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000300 */
#define SYSCFG_EXTICR3_EXTI10                     SYSCFG_EXTICR3_EXTI10_Msk
#define SYSCFG_EXTICR3_EXTI10_0                   (0x1UL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000100 */
#define SYSCFG_EXTICR3_EXTI10_1                   (0x2UL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000200 */
#define SYSCFG_EXTICR3_EXTI11_Pos                 (12U)
#define SYSCFG_EXTICR3_EXTI11_Msk                 (0x3UL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x00003000 */
#define SYSCFG_EXTICR3_EXTI11                     SYSCFG_EXTICR3_EXTI11_Msk                         /*!< EXTI 8~11 configuration */
#define SYSCFG_EXTICR3_EXTI11_0                   (0x1UL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x00001000 */
#define SYSCFG_EXTICR3_EXTI11_1                   (0x2UL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x00002000 */

/********************************* Bit definition for SYSCFG_EXTICR4 register ***************************************/
#define SYSCFG_EXTICR4_EXTI12_Pos                 (0U)
#define SYSCFG_EXTICR4_EXTI12_Msk                 (0x3UL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x00000003 */
#define SYSCFG_EXTICR4_EXTI12                     SYSCFG_EXTICR4_EXTI12_Msk
#define SYSCFG_EXTICR4_EXTI12_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x00000001 */
#define SYSCFG_EXTICR4_EXTI12_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x00000002 */
#define SYSCFG_EXTICR4_EXTI13_Pos                 (4U)
#define SYSCFG_EXTICR4_EXTI13_Msk                 (0x3UL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x00000030 */
#define SYSCFG_EXTICR4_EXTI13                     SYSCFG_EXTICR4_EXTI13_Msk
#define SYSCFG_EXTICR4_EXTI13_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x00000010 */
#define SYSCFG_EXTICR4_EXTI13_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x00000020 */
#define SYSCFG_EXTICR4_EXTI14_Pos                 (8U)
#define SYSCFG_EXTICR4_EXTI14_Msk                 (0x3UL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000300 */
#define SYSCFG_EXTICR4_EXTI14                     SYSCFG_EXTICR4_EXTI14_Msk
#define SYSCFG_EXTICR4_EXTI14_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000100 */
#define SYSCFG_EXTICR4_EXTI14_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000200 */
#define SYSCFG_EXTICR4_EXTI15_Pos                 (12U)
#define SYSCFG_EXTICR4_EXTI15_Msk                 (0x3UL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x00003000 */
#define SYSCFG_EXTICR4_EXTI15                     SYSCFG_EXTICR4_EXTI15_Msk                         /*!< EXTI 12~15 configuration */
#define SYSCFG_EXTICR4_EXTI15_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x00001000 */
#define SYSCFG_EXTICR4_EXTI15_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x00002000 */

/********************************* Bit definition for PA_ENS register ***********************************************/
#define SYSCFG_PAENS_PA_ENS_Pos                         (0U)
#define SYSCFG_PAENS_PA_ENS_Msk                         (0xFFFFUL<<SYSCFG_PAENS_PA_ENS_Pos)                     /*!< 0x0000FFFF */
#define SYSCFG_PAENS_PA_ENS                             SYSCFG_PAENS_PA_ENS_Msk                                 /*!< GPIOA noise filter enable */

/********************************* Bit definition for PB_ENS register ***********************************************/
#define SYSCFG_PBENS_PB_ENS_Pos                         (0U)
#define SYSCFG_PBENS_PB_ENS_Msk                         (0xFFFFUL<<SYSCFG_PBENS_PB_ENS_Pos)                     /*!< 0x0000FFFF */
#define SYSCFG_PBENS_PB_ENS                             SYSCFG_PBENS_PB_ENS_Msk                                 /*!< GPIOB noise filter enable */

/********************************* Bit definition for PC_ENS register ***********************************************/
#define SYSCFG_PCENS_PC_ENS_Pos                         (0U)
#define SYSCFG_PCENS_PC_ENS_Msk                         (0xFFFFUL<<SYSCFG_PCENS_PC_ENS_Pos)                     /*!< 0x0000FFFF */
#define SYSCFG_PCENS_PC_ENS                             SYSCFG_PCENS_PC_ENS_Msk                                 /*!< GPIOC noise filter enable */

/********************************* Bit definition for PD_ENS register ***********************************************/
#define SYSCFG_PDENS_PD_ENS_Pos                         (0U)
#define SYSCFG_PDENS_PD_ENS_Msk                         (0xFFFUL<<SYSCFG_PDENS_PD_ENS_Pos)                      /*!< 0x00000FFF */
#define SYSCFG_PDENS_PD_ENS                             SYSCFG_PDENS_PD_ENS_Msk                                 /*!< GPIOD noise filter enable */

/********************************* Bit definition for COMP_ANA2ENR register *****************************************/
#define SYSCFG_COMP_ANA2ENR_PA0_ENA2_Pos                (0U)
#define SYSCFG_COMP_ANA2ENR_PA0_ENA2_Msk                (0x1UL<<SYSCFG_COMP_ANA2ENR_PA0_ENA2_Pos)                  /*!< 0x00000001 */
#define SYSCFG_COMP_ANA2ENR_PA0_ENA2                    SYSCFG_COMP_ANA2ENR_PA0_ENA2_Msk                           /*!< GPIOA0 ANA2 enable */
#define SYSCFG_COMP_ANA2ENR_PA1_ENA2_Pos                (1U)
#define SYSCFG_COMP_ANA2ENR_PA1_ENA2_Msk                (0x1UL<<SYSCFG_COMP_ANA2ENR_PA1_ENA2_Pos)                  /*!< 0x00000002 */
#define SYSCFG_COMP_ANA2ENR_PA1_ENA2                    SYSCFG_COMP_ANA2ENR_PA1_ENA2_Msk                           /*!< GPIOA1 ANA2 enable */
#define SYSCFG_COMP_ANA2ENR_PA2_ENA2_Pos                (2U)
#define SYSCFG_COMP_ANA2ENR_PA2_ENA2_Msk                (0x1UL<<SYSCFG_COMP_ANA2ENR_PA2_ENA2_Pos)                  /*!< 0x00000004 */
#define SYSCFG_COMP_ANA2ENR_PA2_ENA2                    SYSCFG_COMP_ANA2ENR_PA2_ENA2_Msk                           /*!< GPIOA2 ANA2 enable */
#define SYSCFG_COMP_ANA2ENR_PA3_ENA2_Pos                (3U)
#define SYSCFG_COMP_ANA2ENR_PA3_ENA2_Msk                (0x1UL<<SYSCFG_COMP_ANA2ENR_PA3_ENA2_Pos)                  /*!< 0x00000008 */
#define SYSCFG_COMP_ANA2ENR_PA3_ENA2                    SYSCFG_COMP_ANA2ENR_PA3_ENA2_Msk                           /*!< GPIOA3 ANA2 enable */
#define SYSCFG_COMP_ANA2ENR_PA4_ENA2_Pos                (4U)
#define SYSCFG_COMP_ANA2ENR_PA4_ENA2_Msk                (0x1UL<<SYSCFG_COMP_ANA2ENR_PA4_ENA2_Pos)                  /*!< 0x00000010 */
#define SYSCFG_COMP_ANA2ENR_PA4_ENA2                    SYSCFG_COMP_ANA2ENR_PA4_ENA2_Msk                           /*!< GPIOA4 ANA2 enable */
#define SYSCFG_COMP_ANA2ENR_PA5_ENA2_Pos                (5U)
#define SYSCFG_COMP_ANA2ENR_PA5_ENA2_Msk                (0x1UL<<SYSCFG_COMP_ANA2ENR_PA5_ENA2_Pos)                  /*!< 0x00000020 */
#define SYSCFG_COMP_ANA2ENR_PA5_ENA2                    SYSCFG_COMP_ANA2ENR_PA5_ENA2_Msk                           /*!< GPIOA5 ANA2 enable */
#define SYSCFG_COMP_ANA2ENR_PA9_ENA2_Pos                (9U)
#define SYSCFG_COMP_ANA2ENR_PA9_ENA2_Msk                (0x1UL<<SYSCFG_COMP_ANA2ENR_PA9_ENA2_Pos)                  /*!< 0x00000200 */
#define SYSCFG_COMP_ANA2ENR_PA9_ENA2                    SYSCFG_COMP_ANA2ENR_PA9_ENA2_Msk                           /*!< GPIOA9 ANA2 enable */
#define SYSCFG_COMP_ANA2ENR_PB1_ENA2_Pos                (17U)
#define SYSCFG_COMP_ANA2ENR_PB1_ENA2_Msk                (0x1UL<<SYSCFG_COMP_ANA2ENR_PB1_ENA2_Pos)                  /*!< 0x00002000 */
#define SYSCFG_COMP_ANA2ENR_PB1_ENA2                    SYSCFG_COMP_ANA2ENR_PB1_ENA2_Msk                           /*!< GPIOB1 ANA2 enable */

